Revit 2024 API
ParameterTypeId.FasciaDepthParam Property
 "Fascia Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FasciaDepthParam { get; }
Visual Basic
Public Shared ReadOnly Property FasciaDepthParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FasciaDepthParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace